###############################################################
#  Generated by:      Cadence Innovus 18.10-p002_1
#  OS:                Linux x86_64(Host ID vspace.ecdl.hut.fi)
#  Generated on:      Wed May 25 12:20:43 2022
#  Design:            microcontroller_interface_8_8
#  Command:           saveDesign microcontroller_interface_8_8_design
###############################################################
current_design microcontroller_interface_8_8
create_clock [get_ports {clk}]  -name clk -period 10.000000 -waveform {0.000000 5.000000}
set_clock_transition  -rise -min 0.1 [get_clocks {clk}]
set_clock_transition  -rise -max 0.1 [get_clocks {clk}]
set_clock_transition  -fall -min 0.1 [get_clocks {clk}]
set_clock_transition  -fall -max 0.1 [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {clk}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {clk}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {clk}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {clk}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {rst}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {rst}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {rst}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {rst}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {instr_wr}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {instr_wr}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {instr_wr}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {instr_wr}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {PC_tot[7]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {PC_tot[7]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {PC_tot[7]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {PC_tot[7]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {PC_tot[6]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {PC_tot[6]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {PC_tot[6]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {PC_tot[6]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {PC_tot[5]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {PC_tot[5]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {PC_tot[5]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {PC_tot[5]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {PC_tot[4]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {PC_tot[4]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {PC_tot[4]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {PC_tot[4]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {PC_tot[3]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {PC_tot[3]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {PC_tot[3]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {PC_tot[3]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {PC_tot[2]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {PC_tot[2]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {PC_tot[2]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {PC_tot[2]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {PC_tot[1]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {PC_tot[1]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {PC_tot[1]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {PC_tot[1]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {PC_tot[0]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {PC_tot[0]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {PC_tot[0]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {PC_tot[0]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {instruction_in[13]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {instruction_in[13]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {instruction_in[13]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {instruction_in[13]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {instruction_in[12]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {instruction_in[12]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {instruction_in[12]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {instruction_in[12]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {instruction_in[11]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {instruction_in[11]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {instruction_in[11]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {instruction_in[11]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {instruction_in[10]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {instruction_in[10]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {instruction_in[10]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {instruction_in[10]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {instruction_in[9]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {instruction_in[9]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {instruction_in[9]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {instruction_in[9]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {instruction_in[8]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {instruction_in[8]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {instruction_in[8]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {instruction_in[8]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {instruction_in[7]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {instruction_in[7]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {instruction_in[7]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {instruction_in[7]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {instruction_in[6]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {instruction_in[6]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {instruction_in[6]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {instruction_in[6]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {instruction_in[5]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {instruction_in[5]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {instruction_in[5]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {instruction_in[5]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {instruction_in[4]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {instruction_in[4]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {instruction_in[4]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {instruction_in[4]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {instruction_in[3]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {instruction_in[3]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {instruction_in[3]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {instruction_in[3]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {instruction_in[2]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {instruction_in[2]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {instruction_in[2]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {instruction_in[2]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {instruction_in[1]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {instruction_in[1]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {instruction_in[1]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {instruction_in[1]}]
set_driving_cell -lib_cell INVX1LVT -rise -min [get_ports {instruction_in[0]}]
set_driving_cell -lib_cell INVX1LVT -fall -min [get_ports {instruction_in[0]}]
set_driving_cell -lib_cell INVX1LVT -rise -max [get_ports {instruction_in[0]}]
set_driving_cell -lib_cell INVX1LVT -fall -max [get_ports {instruction_in[0]}]
set_load -pin_load -max  0.001  [get_ports {opcode_status[1]}]
set_load -pin_load -min  0.001  [get_ports {opcode_status[1]}]
set_load -pin_load -max  0.001  [get_ports {opcode_status[0]}]
set_load -pin_load -min  0.001  [get_ports {opcode_status[0]}]
set_load -pin_load -max  0.001  [get_ports {statusOutSPI[2]}]
set_load -pin_load -min  0.001  [get_ports {statusOutSPI[2]}]
set_load -pin_load -max  0.001  [get_ports {statusOutSPI[1]}]
set_load -pin_load -min  0.001  [get_ports {statusOutSPI[1]}]
set_load -pin_load -max  0.001  [get_ports {statusOutSPI[0]}]
set_load -pin_load -min  0.001  [get_ports {statusOutSPI[0]}]
set_load -pin_load -max  0.001  [get_ports {resultOutMemSPI[7]}]
set_load -pin_load -min  0.001  [get_ports {resultOutMemSPI[7]}]
set_load -pin_load -max  0.001  [get_ports {resultOutMemSPI[6]}]
set_load -pin_load -min  0.001  [get_ports {resultOutMemSPI[6]}]
set_load -pin_load -max  0.001  [get_ports {resultOutMemSPI[5]}]
set_load -pin_load -min  0.001  [get_ports {resultOutMemSPI[5]}]
set_load -pin_load -max  0.001  [get_ports {resultOutMemSPI[4]}]
set_load -pin_load -min  0.001  [get_ports {resultOutMemSPI[4]}]
set_load -pin_load -max  0.001  [get_ports {resultOutMemSPI[3]}]
set_load -pin_load -min  0.001  [get_ports {resultOutMemSPI[3]}]
set_load -pin_load -max  0.001  [get_ports {resultOutMemSPI[2]}]
set_load -pin_load -min  0.001  [get_ports {resultOutMemSPI[2]}]
set_load -pin_load -max  0.001  [get_ports {resultOutMemSPI[1]}]
set_load -pin_load -min  0.001  [get_ports {resultOutMemSPI[1]}]
set_load -pin_load -max  0.001  [get_ports {resultOutMemSPI[0]}]
set_load -pin_load -min  0.001  [get_ports {resultOutMemSPI[0]}]
set_load -pin_load -max  0.001  [get_ports {addrSPI[7]}]
set_load -pin_load -min  0.001  [get_ports {addrSPI[7]}]
set_load -pin_load -max  0.001  [get_ports {addrSPI[6]}]
set_load -pin_load -min  0.001  [get_ports {addrSPI[6]}]
set_load -pin_load -max  0.001  [get_ports {addrSPI[5]}]
set_load -pin_load -min  0.001  [get_ports {addrSPI[5]}]
set_load -pin_load -max  0.001  [get_ports {addrSPI[4]}]
set_load -pin_load -min  0.001  [get_ports {addrSPI[4]}]
set_load -pin_load -max  0.001  [get_ports {addrSPI[3]}]
set_load -pin_load -min  0.001  [get_ports {addrSPI[3]}]
set_load -pin_load -max  0.001  [get_ports {addrSPI[2]}]
set_load -pin_load -min  0.001  [get_ports {addrSPI[2]}]
set_load -pin_load -max  0.001  [get_ports {addrSPI[1]}]
set_load -pin_load -min  0.001  [get_ports {addrSPI[1]}]
set_load -pin_load -max  0.001  [get_ports {addrSPI[0]}]
set_load -pin_load -min  0.001  [get_ports {addrSPI[0]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {instruction_in[4]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {PC_tot[6]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {instruction_in[2]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {PC_tot[4]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {instruction_in[0]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {PC_tot[2]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {PC_tot[0]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {instruction_in[9]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {instruction_in[13]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {instruction_in[7]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {instruction_in[11]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {instruction_in[5]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {PC_tot[7]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {instruction_in[3]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {PC_tot[5]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {instruction_in[1]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {PC_tot[3]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {PC_tot[1]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {instr_wr}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {instruction_in[8]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {instruction_in[12]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {instruction_in[6]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {instruction_in[10]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {resultOutMemSPI[7]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {resultOutMemSPI[5]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {addrSPI[6]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {resultOutMemSPI[3]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {addrSPI[4]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {resultOutMemSPI[1]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {addrSPI[2]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {opcode_status[0]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {addrSPI[0]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {statusOutSPI[2]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {statusOutSPI[0]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {resultOutMemSPI[6]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {addrSPI[7]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {resultOutMemSPI[4]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {addrSPI[5]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {resultOutMemSPI[2]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {addrSPI[3]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {resultOutMemSPI[0]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {opcode_status[1]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {addrSPI[1]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {statusOutSPI[1]}]
set_clock_uncertainty 1 -setup [get_clocks {clk}]
